import PageLayout from "../components/PageLayout";
import BackButton from "../components/BackButton";

export default function AboutPage() {
  return (
    <PageLayout>
      <section className="flex flex-col justify-center max-w-[1200px] mx-auto my-10 bg-white/75 p-10 relative rounded-2xl">
        <section>
          <BackButton />
          <h1 className="text-5xl text-center text-black">Оқу құралы туралы</h1>
        </section>
        
        <div className="space-y-6 mt-6 text-black">
          <p className="text-justify text-2xl indent-10">
            Танымдық сала – адамның ойлау қабілетін, білімін, есте сақтауын, қабылдауын, зейінін және логикалық ойлауын қамтитын маңызды аспект. 
            Бұл сала баланың және ересектің дамуына әсер етеді, оның оқу үлгерімі мен жалпы интеллектуалдық дамуына ықпал етеді. 
            Танымдық белсенділіктің төмендеуі балалардың оқудағы қиындықтарының маңызды себептерінің бірі болып саналады. 
            Ол үшін мұғалім оқушылардың танымдық процеске белсенді араласуына жағдай жасап, оларға эмоционалдық қолдау көрсетуі керек.
          </p>

          <p className="text-justify text-2xl indent-10">
            Бұл мәселелерді шешудің бір жолы – оқытудың формалары мен құралдарын әртараптандыруға және оқушылардың шығармашылық белсенділігін арттыруға мүмкіндік беретін оқу үрдісінде заманауи педагогикалық технологияларды пайдалану деп есептейміз. 
            Кез келген технологияда оқушылардың іс-әрекетін белсендіретін құралдар болады, бірақ кейбір технологияларда бұл құралдар негізгі идея мен нәтиженің тиімділігінің негізін құрайды. 
            Баланың интеллектісін, оның моторикасын дамыту үшін, дәлірек айтқанда, қозғалыс координациясын қалыптастыру және көру және мотор анализаторларының бірлескен әрекеттерін үйлестіру үшін оқу және оқу компьютерлік ойындар маңызды рөл атқарады. 
            Электрондық құралда жаттығу-тапсырмалар, қызықты ойындар қамтылып және ата-аналарға үй жағдайында көмекші құрал бола алатындай жасалынды. 
            Компьютерлік әрекет процесінде балада жағымды эмоционалдық реакциялар қалыптасады. 
            Сонымен қатар психикалық процестерді түзету және дамыту жүреді. 
            Оқу компьютерлік ойындар балаларға білімді жақсы меңгеруге көмектеседі және жаңа білім алуды ынталандырады. 
            Ақпараттық-коммуникациялық технологиялар (АКТ) ақпаратты сапалы жаңа деңгейде қабылдауға мүмкіндік береді, бұл баланың танымдық белсенділігін айтарлықтай арттырады. 
            Бала әрбір орындаған тапсырмадан сәттілік сезімін сезініп, әр уақытта оның жұмысының бағасын көруі керек. 
            Компьютерлік оқыту құралдары осы мақсатқа өте қолайлы.
          </p>
        </div>
      </section>
    </PageLayout>
  );
}
